CSI API ETABS v1
cLineElm.GetPoints Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPoints(
	string Name,
	ref string Point1,
	ref string Point2
)
Function GetPoints (
	Name As String,
	ByRef Point1 As String,
	ByRef Point2 As String
) As Integer
Dim instance As cLineElm
Dim Name As String
Dim Point1 As String
Dim Point2 As String
Dim returnValue As Integer
returnValue = instance.GetPoints(Name,
	Point1, Point2)
int GetPoints(
	String^ Name,
	String^% Point1,
	String^% Point2
)
abstract GetPoints :
        Name : string *
        Point1 : string byref *
        Point2 : string byref -> int
Parameters
Name
Type: System.String
Point1
Type: System.String
Point2
Type: System.String
Return Value
Type: Int32
See Also
Reference
cLineElm Interface
ETABSv1 Namespace